# надо
# чтобы
# когда
# студент
# входить
# в
# библиотеку, надо
# спаривать
# номер.Если
# нету
# номера
# в
# базе
# на
# экран
# выйдет
# ошибка(такой
# номер
# нету
# в
# базе ).Если
# этот
# номер
# есть
# в
# базе(если
# админ
# добавил ) тогда
# откроется
# окна
# для
# вода
# e - mail, на
# e - mail
# студента
# мы
# должны
# отправить
# рондомний
# 5
# знатный
# код.потом
# откроется
# следивший
# окно, студент
# пишет
# код.если
# код
# верный
# заходить
# в
# библиотеку, а
# если
# не
# верный(ошибка
# не
# верный
# код ).там
# должно
# быть
# кнопка(получить
# повторный
# код ).